#### `terraform plan` Success
<details><summary>Show Output</summary>

```

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # azurerm_network_interface.main will be destroyed
  - resource "azurerm_network_interface" "main" {
      - applied_dns_servers           = [] -> null
      - dns_servers                   = [] -> null
      - enable_accelerated_networking = false -> null
      - enable_ip_forwarding          = false -> null
      - id                            = "/subscriptions/f18e2af9-2f65-4e18-bc39-54d74e271e7c/resourceGroups/devops-training-team1/providers/Microsoft.Network/networkInterfaces/team1-nic" -> null
      - location                      = "northeurope" -> null
      - mac_address                   = "00-0D-3A-D8-15-13" -> null
      - name                          = "team1-nic" -> null
      - private_ip_address            = "10.0.1.4" -> null
      - private_ip_addresses          = [
          - "10.0.1.4",
        ] -> null
      - resource_group_name           = "devops-training-team1" -> null
      - tags                          = {} -> null
      - virtual_machine_id            = "/subscriptions/f18e2af9-2f65-4e18-bc39-54d74e271e7c/resourceGroups/devops-training-team1/providers/Microsoft.Compute/virtualMachines/team1-vm" -> null

      - ip_configuration {
          - application_gateway_backend_address_pools_ids = [] -> null
          - application_security_group_ids                = [] -> null
          - load_balancer_backend_address_pools_ids       = [] -> null
          - load_balancer_inbound_nat_rules_ids           = [] -> null
          - name                                          = "testconfiguration1" -> null
          - primary                                       = true -> null
          - private_ip_address                            = "10.0.1.4" -> null
          - private_ip_address_allocation                 = "dynamic" -> null
          - private_ip_address_version                    = "IPv4" -> null
          - public_ip_address_id                          = "/subscriptions/f18e2af9-2f65-4e18-bc39-54d74e271e7c/resourceGroups/devops-training-team1/providers/Microsoft.Network/publicIPAddresses/team1-PublicIp" -> null
          - subnet_id                                     = "/subscriptions/f18e2af9-2f65-4e18-bc39-54d74e271e7c/resourceGroups/devops-training-team1/providers/Microsoft.Network/virtualNetworks/team1-network/subnets/team1-internal" -> null
        }
    }

  # azurerm_network_security_rule.main443 will be destroyed
  - resource "azurerm_network_security_rule" "main443" {
      - access                                     = "Allow" -> null
      - destination_address_prefix                 = "*" -> null
      - destination_address_prefixes               = [] -> null
      - destination_application_security_group_ids = [] -> null
      - destination_port_range                     = "5432" -> null
      - destination_port_ranges                    = [] -> null
      - direction                                  = "Inbound" -> null
      - id                                         = "/subscriptions/f18e2af9-2f65-4e18-bc39-54d74e271e7c/resourceGroups/devops-training-team1/providers/Microsoft.Network/networkSecurityGroups/team1-nsg/securityRules/Port_5432" -> null
      - name                                       = "Port_5432" -> null
      - network_security_group_name                = "team1-nsg" -> null
      - priority                                   = 310 -> null
      - protocol                                   = "Tcp" -> null
      - resource_group_name                        = "devops-training-team1" -> null
      - source_address_prefix                      = "*" -> null
      - source_address_prefixes                    = [] -> null
      - source_application_security_group_ids      = [] -> null
      - source_port_range                          = "*" -> null
      - source_port_ranges                         = [] -> null
    }

  # azurerm_network_security_rule.main80 will be destroyed
  - resource "azurerm_network_security_rule" "main80" {
      - access                                     = "Allow" -> null
      - destination_address_prefix                 = "*" -> null
      - destination_address_prefixes               = [] -> null
      - destination_application_security_group_ids = [] -> null
      - destination_port_range                     = "80" -> null
      - destination_port_ranges                    = [] -> null
      - direction                                  = "Inbound" -> null
      - id                                         = "/subscriptions/f18e2af9-2f65-4e18-bc39-54d74e271e7c/resourceGroups/devops-training-team1/providers/Microsoft.Network/networkSecurityGroups/team1-nsg/securityRules/Port_80" -> null
      - name                                       = "Port_80" -> null
      - network_security_group_name                = "team1-nsg" -> null
      - priority                                   = 320 -> null
      - protocol                                   = "Tcp" -> null
      - resource_group_name                        = "devops-training-team1" -> null
      - source_address_prefix                      = "*" -> null
      - source_address_prefixes                    = [] -> null
      - source_application_security_group_ids      = [] -> null
      - source_port_range                          = "*" -> null
      - source_port_ranges                         = [] -> null
    }

  # azurerm_network_security_rule.mainSSH will be destroyed
  - resource "azurerm_network_security_rule" "mainSSH" {
      - access                                     = "Allow" -> null
      - destination_address_prefix                 = "*" -> null
      - destination_address_prefixes               = [] -> null
      - destination_application_security_group_ids = [] -> null
      - destination_port_range                     = "22" -> null
      - destination_port_ranges                    = [] -> null
      - direction                                  = "Inbound" -> null
      - id                                         = "/subscriptions/f18e2af9-2f65-4e18-bc39-54d74e271e7c/resourceGroups/devops-training-team1/providers/Microsoft.Network/networkSecurityGroups/team1-nsg/securityRules/SSH" -> null
      - name                                       = "SSH" -> null
      - network_security_group_name                = "team1-nsg" -> null
      - priority                                   = 300 -> null
      - protocol                                   = "Tcp" -> null
      - resource_group_name                        = "devops-training-team1" -> null
      - source_address_prefix                      = "*" -> null
      - source_address_prefixes                    = [] -> null
      - source_application_security_group_ids      = [] -> null
      - source_port_range                          = "*" -> null
      - source_port_ranges                         = [] -> null
    }

  # azurerm_network_security_rule.ssh will be created
  + resource "azurerm_network_security_rule" "ssh" {
      + access                      = "Allow"
      + destination_address_prefix  = "*"
      + destination_port_range      = "22"
      + direction                   = "Inbound"
      + id                          = (known after apply)
      + name                        = "SSH"
      + network_security_group_name = "team1-nsg"
      + priority                    = 300
      + protocol                    = "Tcp"
      + resource_group_name         = "devops-training-team1"
      + source_address_prefix       = "*"
      + source_port_range           = "*"
    }

  # azurerm_network_security_rule.vm1http will be created
  + resource "azurerm_network_security_rule" "vm1http" {
      + access                      = "Allow"
      + destination_address_prefix  = (known after apply)
      + destination_port_range      = "80"
      + direction                   = "Inbound"
      + id                          = (known after apply)
      + name                        = "Port_Internet_80"
      + network_security_group_name = "team1-nsg"
      + priority                    = 320
      + protocol                    = "Tcp"
      + resource_group_name         = "devops-training-team1"
      + source_address_prefix       = "*"
      + source_port_range           = "*"
    }

  # azurerm_network_security_rule.vm2http will be created
  + resource "azurerm_network_security_rule" "vm2http" {
      + access                      = "Allow"
      + destination_address_prefix  = (known after apply)
      + destination_port_range      = "80"
      + direction                   = "Inbound"
      + id                          = (known after apply)
      + name                        = "Port_Internal_80"
      + network_security_group_name = "team1-nsg"
      + priority                    = 320
      + protocol                    = "Tcp"
      + resource_group_name         = "devops-training-team1"
      + source_address_prefix       = (known after apply)
      + source_port_range           = "*"
    }

  # azurerm_network_security_rule.vm3psql will be created
  + resource "azurerm_network_security_rule" "vm3psql" {
      + access                      = "Allow"
      + destination_address_prefix  = (known after apply)
      + destination_port_range      = "5432"
      + direction                   = "Inbound"
      + id                          = (known after apply)
      + name                        = "Port_Internal_5432"
      + network_security_group_name = "team1-nsg"
      + priority                    = 310
      + protocol                    = "Tcp"
      + resource_group_name         = "devops-training-team1"
      + source_address_prefix       = (known after apply)
      + source_port_range           = "5432"
    }

  # azurerm_public_ip.main will be destroyed
  - resource "azurerm_public_ip" "main" {
      - allocation_method            = "Static" -> null
      - id                           = "/subscriptions/f18e2af9-2f65-4e18-bc39-54d74e271e7c/resourceGroups/devops-training-team1/providers/Microsoft.Network/publicIPAddresses/team1-PublicIp" -> null
      - idle_timeout_in_minutes      = 4 -> null
      - ip_address                   = "52.178.209.161" -> null
      - ip_version                   = "IPv4" -> null
      - location                     = "northeurope" -> null
      - name                         = "team1-PublicIp" -> null
      - public_ip_address_allocation = "Static" -> null
      - resource_group_name          = "devops-training-team1" -> null
      - sku                          = "Basic" -> null
      - tags                         = {} -> null
      - zones                        = [] -> null
    }

  # azurerm_virtual_machine.main will be destroyed
  - resource "azurerm_virtual_machine" "main" {
      - delete_data_disks_on_termination = false -> null
      - delete_os_disk_on_termination    = false -> null
      - id                               = "/subscriptions/f18e2af9-2f65-4e18-bc39-54d74e271e7c/resourceGroups/devops-training-team1/providers/Microsoft.Compute/virtualMachines/team1-vm" -> null
      - location                         = "northeurope" -> null
      - name                             = "team1-vm" -> null
      - network_interface_ids            = [
          - "/subscriptions/f18e2af9-2f65-4e18-bc39-54d74e271e7c/resourceGroups/devops-training-team1/providers/Microsoft.Network/networkInterfaces/team1-nic",
        ] -> null
      - resource_group_name              = "devops-training-team1" -> null
      - tags                             = {
          - "environment" = "staging"
        } -> null
      - vm_size                          = "Standard_B1ms" -> null
      - zones                            = [] -> null

      - os_profile {
          - admin_username = "testadmin" -> null
          - computer_name  = "hostname" -> null
        }

      - os_profile_linux_config {
          - disable_password_authentication = false -> null
        }

      - storage_image_reference {
          - offer     = "UbuntuServer" -> null
          - publisher = "Canonical" -> null
          - sku       = "18.04-LTS" -> null
          - version   = "latest" -> null
        }

      - storage_os_disk {
          - caching                   = "ReadWrite" -> null
          - create_option             = "FromImage" -> null
          - disk_size_gb              = 30 -> null
          - managed_disk_id           = "/subscriptions/f18e2af9-2f65-4e18-bc39-54d74e271e7c/resourceGroups/devops-training-team1/providers/Microsoft.Compute/disks/myosdisk1" -> null
          - managed_disk_type         = "Standard_LRS" -> null
          - name                      = "myosdisk1" -> null
          - os_type                   = "Linux" -> null
          - write_accelerator_enabled = false -> null
        }
    }

  # azurerm_virtual_machine_extension.main will be destroyed
  - resource "azurerm_virtual_machine_extension" "main" {
      - auto_upgrade_minor_version = false -> null
      - id                         = "/subscriptions/f18e2af9-2f65-4e18-bc39-54d74e271e7c/resourceGroups/devops-training-team1/providers/Microsoft.Compute/virtualMachines/team1-vm/extensions/nginx" -> null
      - location                   = "northeurope" -> null
      - name                       = "nginx" -> null
      - protected_settings         = (sensitive value)
      - publisher                  = "Microsoft.Azure.Extensions" -> null
      - resource_group_name        = "devops-training-team1" -> null
      - tags                       = {} -> null
      - type                       = "CustomScript" -> null
      - type_handler_version       = "2.0" -> null
      - virtual_machine_id         = "/subscriptions/f18e2af9-2f65-4e18-bc39-54d74e271e7c/resourceGroups/devops-training-team1/providers/Microsoft.Compute/virtualMachines/team1-vm" -> null
      - virtual_machine_name       = "team1-vm" -> null
    }

  # module.vm1.azurerm_network_interface.main will be created
  + resource "azurerm_network_interface" "main" {
      + applied_dns_servers           = (known after apply)
      + dns_servers                   = (known after apply)
      + enable_accelerated_networking = false
      + enable_ip_forwarding          = false
      + id                            = (known after apply)
      + internal_dns_name_label       = (known after apply)
      + internal_fqdn                 = (known after apply)
      + location                      = "northeurope"
      + mac_address                   = (known after apply)
      + name                          = "team11-vm-nic"
      + private_ip_address            = (known after apply)
      + private_ip_addresses          = (known after apply)
      + resource_group_name           = "devops-training-team1"
      + tags                          = (known after apply)
      + virtual_machine_id            = (known after apply)

      + ip_configuration {
          + application_gateway_backend_address_pools_ids = (known after apply)
          + application_security_group_ids                = (known after apply)
          + load_balancer_backend_address_pools_ids       = (known after apply)
          + load_balancer_inbound_nat_rules_ids           = (known after apply)
          + name                                          = "testconfiguration1"
          + primary                                       = (known after apply)
          + private_ip_address                            = (known after apply)
          + private_ip_address_allocation                 = "dynamic"
          + private_ip_address_version                    = "IPv4"
          + public_ip_address_id                          = (known after apply)
          + subnet_id                                     = "/subscriptions/f18e2af9-2f65-4e18-bc39-54d74e271e7c/resourceGroups/devops-training-team1/providers/Microsoft.Network/virtualNetworks/team1-network/subnets/team1-internal"
        }
    }

  # module.vm1.azurerm_public_ip.main will be created
  + resource "azurerm_public_ip" "main" {
      + allocation_method            = "Static"
      + fqdn                         = (known after apply)
      + id                           = (known after apply)
      + idle_timeout_in_minutes      = 4
      + ip_address                   = (known after apply)
      + ip_version                   = "IPv4"
      + location                     = "northeurope"
      + name                         = "team11-vm-pip"
      + public_ip_address_allocation = (known after apply)
      + resource_group_name          = "devops-training-team1"
      + sku                          = "Basic"
      + tags                         = (known after apply)
    }

  # module.vm1.azurerm_virtual_machine.main will be created
  + resource "azurerm_virtual_machine" "main" {
      + availability_set_id              = (known after apply)
      + delete_data_disks_on_termination = false
      + delete_os_disk_on_termination    = false
      + id                               = (known after apply)
      + license_type                     = (known after apply)
      + location                         = "northeurope"
      + name                             = "team11-vm"
      + network_interface_ids            = (known after apply)
      + resource_group_name              = "devops-training-team1"
      + tags                             = (known after apply)
      + vm_size                          = "Standard_B1ms"

      + identity {
          + identity_ids = (known after apply)
          + principal_id = (known after apply)
          + type         = (known after apply)
        }

      + os_profile {
          + admin_password = (sensitive value)
          + admin_username = "test"
          + computer_name  = "hostname"
          + custom_data    = (known after apply)
        }

      + os_profile_linux_config {
          + disable_password_authentication = false
        }

      + storage_data_disk {
          + caching                   = (known after apply)
          + create_option             = (known after apply)
          + disk_size_gb              = (known after apply)
          + lun                       = (known after apply)
          + managed_disk_id           = (known after apply)
          + managed_disk_type         = (known after apply)
          + name                      = (known after apply)
          + vhd_uri                   = (known after apply)
          + write_accelerator_enabled = (known after apply)
        }

      + storage_image_reference {
          + offer     = "UbuntuServer"
          + publisher = "Canonical"
          + sku       = "18.04-LTS"
          + version   = "latest"
        }

      + storage_os_disk {
          + caching                   = "ReadWrite"
          + create_option             = "FromImage"
          + disk_size_gb              = (known after apply)
          + managed_disk_id           = (known after apply)
          + managed_disk_type         = "Standard_LRS"
          + name                      = "osdisk"
          + os_type                   = (known after apply)
          + write_accelerator_enabled = false
        }
    }

  # module.vm1.azurerm_virtual_machine_extension.main[0] will be created
  + resource "azurerm_virtual_machine_extension" "main" {
      + id                   = (known after apply)
      + location             = (known after apply)
      + name                 = "nginx"
      + protected_settings   = (sensitive value)
      + publisher            = "Microsoft.Azure.Extensions"
      + resource_group_name  = (known after apply)
      + tags                 = (known after apply)
      + type                 = "CustomScript"
      + type_handler_version = "2.0"
      + virtual_machine_id   = (known after apply)
      + virtual_machine_name = (known after apply)
    }

  # module.vm2.azurerm_network_interface.main will be created
  + resource "azurerm_network_interface" "main" {
      + applied_dns_servers           = (known after apply)
      + dns_servers                   = (known after apply)
      + enable_accelerated_networking = false
      + enable_ip_forwarding          = false
      + id                            = (known after apply)
      + internal_dns_name_label       = (known after apply)
      + internal_fqdn                 = (known after apply)
      + location                      = "northeurope"
      + mac_address                   = (known after apply)
      + name                          = "team12-vm-nic"
      + private_ip_address            = (known after apply)
      + private_ip_addresses          = (known after apply)
      + resource_group_name           = "devops-training-team1"
      + tags                          = (known after apply)
      + virtual_machine_id            = (known after apply)

      + ip_configuration {
          + application_gateway_backend_address_pools_ids = (known after apply)
          + application_security_group_ids                = (known after apply)
          + load_balancer_backend_address_pools_ids       = (known after apply)
          + load_balancer_inbound_nat_rules_ids           = (known after apply)
          + name                                          = "testconfiguration1"
          + primary                                       = (known after apply)
          + private_ip_address                            = (known after apply)
          + private_ip_address_allocation                 = "dynamic"
          + private_ip_address_version                    = "IPv4"
          + public_ip_address_id                          = (known after apply)
          + subnet_id                                     = "/subscriptions/f18e2af9-2f65-4e18-bc39-54d74e271e7c/resourceGroups/devops-training-team1/providers/Microsoft.Network/virtualNetworks/team1-network/subnets/team1-internal"
        }
    }

  # module.vm2.azurerm_public_ip.main will be created
  + resource "azurerm_public_ip" "main" {
      + allocation_method            = "Static"
      + fqdn                         = (known after apply)
      + id                           = (known after apply)
      + idle_timeout_in_minutes      = 4
      + ip_address                   = (known after apply)
      + ip_version                   = "IPv4"
      + location                     = "northeurope"
      + name                         = "team12-vm-pip"
      + public_ip_address_allocation = (known after apply)
      + resource_group_name          = "devops-training-team1"
      + sku                          = "Basic"
      + tags                         = (known after apply)
    }

  # module.vm2.azurerm_virtual_machine.main will be created
  + resource "azurerm_virtual_machine" "main" {
      + availability_set_id              = (known after apply)
      + delete_data_disks_on_termination = false
      + delete_os_disk_on_termination    = false
      + id                               = (known after apply)
      + license_type                     = (known after apply)
      + location                         = "northeurope"
      + name                             = "team12-vm"
      + network_interface_ids            = (known after apply)
      + resource_group_name              = "devops-training-team1"
      + tags                             = (known after apply)
      + vm_size                          = "Standard_B1ms"

      + identity {
          + identity_ids = (known after apply)
          + principal_id = (known after apply)
          + type         = (known after apply)
        }

      + os_profile {
          + admin_password = (sensitive value)
          + admin_username = "test"
          + computer_name  = "hostname"
          + custom_data    = (known after apply)
        }

      + os_profile_linux_config {
          + disable_password_authentication = false
        }

      + storage_data_disk {
          + caching                   = (known after apply)
          + create_option             = (known after apply)
          + disk_size_gb              = (known after apply)
          + lun                       = (known after apply)
          + managed_disk_id           = (known after apply)
          + managed_disk_type         = (known after apply)
          + name                      = (known after apply)
          + vhd_uri                   = (known after apply)
          + write_accelerator_enabled = (known after apply)
        }

      + storage_image_reference {
          + offer     = "UbuntuServer"
          + publisher = "Canonical"
          + sku       = "18.04-LTS"
          + version   = "latest"
        }

      + storage_os_disk {
          + caching                   = "ReadWrite"
          + create_option             = "FromImage"
          + disk_size_gb              = (known after apply)
          + managed_disk_id           = (known after apply)
          + managed_disk_type         = "Standard_LRS"
          + name                      = "osdisk"
          + os_type                   = (known after apply)
          + write_accelerator_enabled = false
        }
    }

  # module.vm2.azurerm_virtual_machine_extension.main[0] will be created
  + resource "azurerm_virtual_machine_extension" "main" {
      + id                   = (known after apply)
      + location             = (known after apply)
      + name                 = "nginx"
      + protected_settings   = (sensitive value)
      + publisher            = "Microsoft.Azure.Extensions"
      + resource_group_name  = (known after apply)
      + tags                 = (known after apply)
      + type                 = "CustomScript"
      + type_handler_version = "2.0"
      + virtual_machine_id   = (known after apply)
      + virtual_machine_name = (known after apply)
    }

  # module.vm3.azurerm_network_interface.main will be created
  + resource "azurerm_network_interface" "main" {
      + applied_dns_servers           = (known after apply)
      + dns_servers                   = (known after apply)
      + enable_accelerated_networking = false
      + enable_ip_forwarding          = false
      + id                            = (known after apply)
      + internal_dns_name_label       = (known after apply)
      + internal_fqdn                 = (known after apply)
      + location                      = "northeurope"
      + mac_address                   = (known after apply)
      + name                          = "team13-vm-nic"
      + private_ip_address            = (known after apply)
      + private_ip_addresses          = (known after apply)
      + resource_group_name           = "devops-training-team1"
      + tags                          = (known after apply)
      + virtual_machine_id            = (known after apply)

      + ip_configuration {
          + application_gateway_backend_address_pools_ids = (known after apply)
          + application_security_group_ids                = (known after apply)
          + load_balancer_backend_address_pools_ids       = (known after apply)
          + load_balancer_inbound_nat_rules_ids           = (known after apply)
          + name                                          = "testconfiguration1"
          + primary                                       = (known after apply)
          + private_ip_address                            = (known after apply)
          + private_ip_address_allocation                 = "dynamic"
          + private_ip_address_version                    = "IPv4"
          + public_ip_address_id                          = (known after apply)
          + subnet_id                                     = "/subscriptions/f18e2af9-2f65-4e18-bc39-54d74e271e7c/resourceGroups/devops-training-team1/providers/Microsoft.Network/virtualNetworks/team1-network/subnets/team1-internal"
        }
    }

  # module.vm3.azurerm_public_ip.main will be created
  + resource "azurerm_public_ip" "main" {
      + allocation_method            = "Static"
      + fqdn                         = (known after apply)
      + id                           = (known after apply)
      + idle_timeout_in_minutes      = 4
      + ip_address                   = (known after apply)
      + ip_version                   = "IPv4"
      + location                     = "northeurope"
      + name                         = "team13-vm-pip"
      + public_ip_address_allocation = (known after apply)
      + resource_group_name          = "devops-training-team1"
      + sku                          = "Basic"
      + tags                         = (known after apply)
    }

  # module.vm3.azurerm_virtual_machine.main will be created
  + resource "azurerm_virtual_machine" "main" {
      + availability_set_id              = (known after apply)
      + delete_data_disks_on_termination = false
      + delete_os_disk_on_termination    = false
      + id                               = (known after apply)
      + license_type                     = (known after apply)
      + location                         = "northeurope"
      + name                             = "team13-vm"
      + network_interface_ids            = (known after apply)
      + resource_group_name              = "devops-training-team1"
      + tags                             = (known after apply)
      + vm_size                          = "Standard_B1ms"

      + identity {
          + identity_ids = (known after apply)
          + principal_id = (known after apply)
          + type         = (known after apply)
        }

      + os_profile {
          + admin_password = (sensitive value)
          + admin_username = "test"
          + computer_name  = "hostname"
          + custom_data    = (known after apply)
        }

      + os_profile_linux_config {
          + disable_password_authentication = false
        }

      + storage_data_disk {
          + caching                   = (known after apply)
          + create_option             = (known after apply)
          + disk_size_gb              = (known after apply)
          + lun                       = (known after apply)
          + managed_disk_id           = (known after apply)
          + managed_disk_type         = (known after apply)
          + name                      = (known after apply)
          + vhd_uri                   = (known after apply)
          + write_accelerator_enabled = (known after apply)
        }

      + storage_image_reference {
          + offer     = "UbuntuServer"
          + publisher = "Canonical"
          + sku       = "18.04-LTS"
          + version   = "latest"
        }

      + storage_os_disk {
          + caching                   = "ReadWrite"
          + create_option             = "FromImage"
          + disk_size_gb              = (known after apply)
          + managed_disk_id           = (known after apply)
          + managed_disk_type         = "Standard_LRS"
          + name                      = "osdisk"
          + os_type                   = (known after apply)
          + write_accelerator_enabled = false
        }
    }

Plan: 15 to add, 0 to change, 7 to destroy.
```

</details>

*Workflow: `Terraform validation`, Action: `hashicorpterraform-github-actions4`, Working Directory: `./Oppgave1`*
